import dayjs from "dayjs"
import utc from "dayjs/plugin/utc"
import timezone from "dayjs/plugin/timezone"
dayjs.extend(utc)
dayjs.extend(timezone)

import { staticPath } from "src/utils/$path"
import { STAGE_GUIDANCE_URL } from "src/constants/links"

type Announcement = {
  id: string
  date: dayjs.Dayjs
  title: string
  text: string
  links?: {
    url: string
    label?: string
  }[]
}

export const announcements: Announcement[] = [
  {
    id: "a9294c64-e886-44b5-b305-d8cb548d60d7",
    date: dayjs.tz("2021-05-19T18:30:00", "Asia/Tokyo"),
    title: "オンラインステージ用募集要項公開",
    text: [
      "本日付けでオンラインステージ用募集要項を公開いたします。対面開催中止に伴う前回学園祭からの変更点等について記載されておりますので、企画応募をご検討の皆様は必ずご確認ください。",
      "今後も学園祭について情報発信を行ってまいりますので、ご確認のほどよろしくお願い申し上げます。",
    ].join("\n"),
    links: [
      {
        url: staticPath.docs["オンラインステージ企画用募集要項_210519_pdf"],
        label: "オンラインステージ企画用募集要項",
      },
    ],
  },
  {
    id: "df454852-f9af-40cd-b281-f1a3c11265e2",
    date: dayjs.tz("2021-05-20T18:30:00", "Asia/Tokyo"),
    title: "雙峰祭ガイダンス(オンラインステージ企画用)公開",
    text: [
      "オンラインステージ企画用雙峰祭ガイダンスを公開いたします。",
      "雙峰祭ガイダンスとは、前回学園祭からの変更点や特に重要な内容を簡潔にまとめた動画でございます。今年度は非常に多くの変更点がございますので、募集要項をご確認の際にぜひご一緒にご視聴ください。",
    ].join("\n"),
    links: [
      {
        url: STAGE_GUIDANCE_URL,
        label: "オンラインステージ企画用雙峰祭ガイダンス",
      },
    ],
  },
  {
    id: "ebf708a8-0eb7-48db-b2d9-d33c0184c951",
    date: dayjs.tz("2021-05-23T18:30:00", "Asia/Tokyo"),
    title: "企画団体向けTwitterアカウント",
    text: [
      "企画団体向けTwitterアカウント@kikakurenrakunでは、企画応募を検討されている皆様に便利な情報を随時お届けしております。ぜひご確認ください。",
      "https://twitter.com/kikakurenrakun",
      "なお、ツイートはトップページのお知らせ欄からもご覧いただけます。",
    ].join("\n"),
  },
  {
    id: "eb840c93-ca79-48c1-b1f0-9c4b9569ce6c",
    date: dayjs.tz("2021-05-24T18:30:00", "Asia/Tokyo"),
    title: "オンラインステージの企画応募開始について",
    text: [
      "オンラインステージの企画応募を開始いたしました。",
      "締切は6月4日金曜日23:59です。",
      "感染症への対応など、前回からの変更点が多数ございますので、ご応募の前に募集要項・感染症拡大防止ガイドライン(案)を必ずご確認ください。",
      "締切を過ぎた申し込みは受付いたしかねますので、余裕を持ったご応募をお願いいたします。",
      "なお、一般企画については今回の企画応募の対象ではございません。6月下旬～7月下旬に募集要項配布を予定しておりますので、今後の情報にご注意ください。",
    ].join("\n"),
  },
  {
    id: "bce0068c-56b5-4cc5-8183-088fd10120ff",
    date: dayjs.tz("2021-05-24T18:20:00", "Asia/Tokyo"),
    title: "感染症拡大防止ガイドライン(案)の公開について",
    text: [
      "学園祭開催に向けた感染症拡大防止ガイドライン(案)<オンラインステージ用>を公開いたします。",
      "こちらはコロナ禍において学園祭を実施するにあたって、学実委や皆様が実施するべき感染症対策をまとめたものでございます。企画応募前に必ずご一読ください。",
      "なお、企画者の皆様にお願いする対策につきましては、募集要項巻末の「感染対策防止要綱」にもまとめて掲載しております。",
      "また、本ガイドライン案は、本学の対策指針の変更などに応じて随時変更いたします。変更の際には改めてお知らせいたしますので、学実委からの情報にご注意ください。",
      "このガイドライン(案)に関するご意見・ご質問がございましたら、学実委までお問い合わせください。",
    ].join("\n"),
    links: [
      {
        url: staticPath.docs[
          "感染症拡大防止ガイドライン_案__オンラインステージ企画募集改0524_pdf"
        ],
        label:
          "学園祭開催に向けた感染症拡大防止ガイドライン(案)<オンラインステージ用>",
      },
    ],
  },
  {
    id: "ab414ffb-4aef-46ac-8d34-eb885fe21389",
    date: dayjs.tz("2021-06-04T18:30:00", "Asia/Tokyo"),
    title: "【重要】オンラインステージ 企画応募受付期間変更のご案内",
    text: [
      "6月4日(金)を予定しておりましたオンラインステージの受付締切でございますが、6月8日(火)23:59までに変更することといたしました。",
      "企画応募期間を過ぎたお申込みは受付いたしかねますので、お忘れなく6月8日(火)23:59までにご応募くださいますようお願いいたします。",
    ].join("\n"),
  },
  {
    id: "2227b6b9-59f8-45b7-9ec5-2b58053d1378",
    date: dayjs.tz("2021-06-04T18:30:00", "Asia/Tokyo"),
    title: "雙峰祭オンラインシステムを用いた副企画責任者の登録について",
    text: [
      "雙峰祭オンラインシステムにおける副企画責任者の登録方法について補足いたします。",
      "企画責任者が企画基本情報を入力したあと、企画トップページ上部に示された手順に従うと「副責任者の登録へ」というボタンが表示されます。このボタンを押すと副企画責任者に共有するためのURLが表示されますので、これを副企画責任者に共有してください。副企画責任者が自身のパソコンでURLにアクセスすると、承認画面が表示されます。承認すると副企画責任者として登録され、企画応募が完了いたします。",
      "なお、企画応募の手順につきましては、以下の動画で画面をお見せしながら詳しく説明しております。ぜひご確認ください。",
      "https://www.youtube.com/watch?v=rl5eMsxUXkw",
    ].join("\n"),
  },
  {
    id: "a05bcf0a-0c02-4045-95b2-e5e2397685fc",
    date: dayjs.tz("2021-06-12T09:00:00", "Asia/Tokyo"),
    title: "オンラインステージ企画抽選会",
    text: [
      "本日13時から企画抽選会のライブ配信を実施いたします。限定公開となっておりますので以下のURLからご覧ください。ライブ終了後もこちらのURLからアーカイブ配信がご視聴いただけます。",
      "https://youtu.be/4oB0UsBkJSM",
    ].join("\n"),
  },
  {
    id: "0b1958e3-92d0-4b80-a343-64274aece381",
    date: dayjs.tz("2021-06-16T12:00:00", "Asia/Tokyo"),
    title: "第1回ステージ組合",
    text: [
      "6月16日18:30より第1回ステージ組合を実施いたします。オンラインステージにご参加される企画団体におかれましては、雙峰祭オンラインシステムのファイル配付ページより資料と動画のご視聴をお願いいたします。",
      "動画ご視聴が終わりましたら雙峰祭オンラインシステム申請ページの「第1回ステージ組合出席確認回答フォーム」にて動画内で説明いたしますクイズにお答えください。",
    ].join("\n"),
  },
  {
    id: "679209f5-1991-4ba0-84b1-c82a0dff2c62",
    date: dayjs.tz("2021-07-06T00:00:00", "Asia/Tokyo"),
    title: "第2回ステージ組合",
    text: [
      "7月6日18:30より第2回ステージ組合を実施いたします。オンラインステージにご参加される企画団体におかれましては、雙峰祭オンラインシステムのファイル配付ページにございます「第2回ステージ組合」より資料と動画のご視聴をお願いいたします。",
      "動画のご視聴が終わりましたら雙峰祭オンラインシステム申請ページの「第2回ステージ組合出席確認回答フォーム」にて動画内で提示いたしますクイズにお答えください。",
    ].join("\n"),
  },
]
/**
 * この下を書き換えた場合は bin/scaffoldAnnouncement も書き換える必要がないか確認する
 */
